In [1]:
#import pandas
import pandas as pd

## Read the three files into python as dataframes

In [27]:
#Read the three files into python as dataframes
df1 = pd.read_csv('file1.csv')
#df1 #to check if you imported correctly

In [28]:
df2 = pd.read_csv('file2.csv')
#df2 #to check if you imported correctly

In [29]:
df3 = pd.read_csv('file3.csv')
#df3 #to check if you imported correctly

## Show the DataFrame's shape

In [30]:
#Show the DataFrame's shape: dataframe 1
[rowdf1,coldf1] = df1.shape
print ("dataframe 1 has " + str(rowdf1) + " rows and " + str(coldf1) + " columns")

dataframe 1 has 4008 rows and 11 columns

In [31]:
#Show the DataFrame's shape: dataframe 2
[rowdf2,coldf2] = df2.shape
print ("dataframe 2 has " + str(rowdf2) + " rows and " + str(coldf2) + " columns")

dataframe 2 has 996 rows and 11 columns

In [32]:
#Show the DataFrame's shape: dataframe 2
[rowdf3,coldf3] = df3.shape
print ("dataframe 3 has " + str(rowdf3) + " rows and " + str(coldf3) + " columns")

dataframe 3 has 7070 rows and 11 columns

## Standardize header names.

In [33]:
#lowercase the names of the columns df1
df1.columns= df1.columns.str.lower()
#df1.columns

In [34]:
#lowercase the names of the columns df2
df2.columns= df2.columns.str.lower()
#df2.columns

In [35]:
#lowercase the names of the columns df3
df3.columns= df3.columns.str.lower()
#df3.columns

In [36]:
df3.rename(columns={"state": "st"}, inplace = True)
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7070 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   7070 non-null   object
 1   st                         7070 non-null   object
 2   customer lifetime value    7070 non-null   float64
 3   education                  7070 non-null   object
 4   gender                     7070 non-null   object
 5   income                     7070 non-null   int64
 6   monthly premium auto       7070 non-null   int64
 7   number of open complaints  7070 non-null   int64
 8   policy type                7070 non-null   object
 9   total claim amount         7070 non-null   float64
 10  vehicle class              7070 non-null   object
dtypes: float64(2), int64(3), object(6)
memory usage: 607.7+ KB

## Rearrange the columns in the dataframe as necessary: rearranging the columns following dataframe 1

In [37]:
#Rearrange the columns in the dataframe as necessary: rearranging the columns following dataframe 1
df1_col_lst = df1.columns.to_list()
df1_col_lst

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']

In [38]:
df2 = df2.reindex(columns = df1_col_lst)

In [39]:
df3 = df3.reindex(columns = df1_col_lst)

## Concatenate the three dataframes

In [41]:
#Concatenate the three dataframes 
df_all = pd.concat([df1, df2,df3], axis=0, ignore_index=True)

## Which columns are numerical?

In [42]:
#Which columns are numerical?
df_all.info()
#according to data type, Income, monthly premium auto and total claim amount are numerical.
# BUT observing the variables it seems that customer lifetime value and number of open complaints have been stored as objects, but are numerical as well.
#all the other variables are categorical

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074 entries, 0 to 12073
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   st                         9137 non-null   object
 2   gender                     9015 non-null   object
 3   education                  9137 non-null   object
 4   customer lifetime value    9130 non-null   object
 5   income                     9137 non-null   float64
 6   monthly premium auto       9137 non-null   float64
 7   number of open complaints  9137 non-null   object
 8   policy type                9137 non-null   object
 9   vehicle class              9137 non-null   object
 10  total claim amount         9137 non-null   float64
dtypes: float64(3), object(8)
memory usage: 1.0+ MB

## Understand the meaning of all columns
- customer: license plate
- st: state of license plate
- gender: gender
- education: highest education degree
- customer life time value: value in money of the customer? as in how much money the insurance would pay if the customer dies?
- income: yearly income
- monthly premium auto: amount of money the customer pays each month
- number of open complaints: 
- policy type: whether the auto is self-owned, from the company, "special Auto" = other cases
- vehicle class: category to which the vehicle belongs to
- total claim amount: maximum amount of money the customer can receive from the insurance upon accident

## Perform the data cleaning operations mentioned so far in class

In [43]:
#Delete the column education and the number of open complaints from the dataframe.
df_all = df_all.drop(["education","number of open complaints"],axis = 1) # axis = 0 to delete rows, axis = 1 to delete columns
df_all #to check if are dropped

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...
12069,LA72316,California,M,23405.98798,71941.0,73.0,Personal Auto,Four-Door Car,198.234764
12070,PK87824,California,F,3096.511217,21604.0,79.0,Corporate Auto,Four-Door Car,379.200000
12071,TD14365,California,M,8163.890428,0.0,85.0,Corporate Auto,Four-Door Car,790.784983
12072,UP19263,California,M,7524.442436,21941.0,96.0,Personal Auto,Four-Door Car,691.200000
12073,Y167826,California,M,2611.836866,0.0,77.0,Corporate Auto,Two-Door Car,369.600000

In [44]:
#Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.
#Since some of them contains the symbol "%", find all the rows that contains this symbol and drop it

new_customer_lifetime_values = []

for i in range (len(df_all["customer lifetime value"])):
    entry = df_all["customer lifetime value"][i]
    if type (df_all["customer lifetime value"][i]) == str:
        if entry[-1] == "%":
            new_customer_lifetime_values.append(entry[:-1])
        else:
            new_customer_lifetime_values.append(entry)
    else:
        new_customer_lifetime_values.append(entry)

len(new_customer_lifetime_values) #check if there are the exact number of entries

12074

In [45]:
#convert all the entries of the new_customer_lifetime_values in float and multiply them by 100 
new_customer_lifetime_values_float =[]
for i in range(len(new_customer_lifetime_values)):
    entry = new_customer_lifetime_values[i]
    if type(new_customer_lifetime_values[i]) == str:
        entry = float(entry)
        new_customer_lifetime_values_float.append(entry*100)
    else:
        new_customer_lifetime_values_float.append(entry*100)

In [46]:
#add the new variable to the dataframe
df_all.insert(coldf1-2,'new_customer_lifetime_values', new_customer_lifetime_values_float)

In [47]:
#Check for duplicate rows in the data and remove if any.
#first remove all the entries with nan as an ID customer
df_all = df_all.dropna(subset = ["customer"])

In [48]:
df_all[df_all["customer"].isna() == True] #check if the dropna worked

Empty DataFrame
Columns: [customer, st, gender, customer lifetime value, income, monthly premium auto, policy type, vehicle class, total claim amount, new_customer_lifetime_values]
Index: []

In [49]:
#Check for (invalid) duplicates in the dataframe.
df_all.duplicated().sum()

3

In [55]:
#drop the duplicates
df_all = df_all.drop_duplicates()
df_all.shape

(9134, 10)

In [54]:
df_all.duplicated().sum()

0

In [52]:
#Filter out the data for customers who have an income of 0 or less.
final_df_all = df_all.query('income > 0')

In [53]:
final_df_all

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount,new_customer_lifetime_values
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247,1.288743e+08
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323,5.363076e+07
5,OC83172,Oregon,F,825629.78%,62902.0,69.0,Personal Auto,Two-Door Car,159.383042,8.256298e+07
6,XZ87318,Oregon,F,538089.86%,55350.0,67.0,Corporate Auto,Four-Door Car,321.600000,5.380899e+07
8,DY87989,Oregon,M,2412750.40%,14072.0,71.0,Corporate Auto,Four-Door Car,511.200000,2.412750e+08
...,...,...,...,...,...,...,...,...,...,...
12067,TF56202,California,M,5032.165498,66367.0,64.0,Personal Auto,Two-Door Car,307.200000,5.032165e+05
12068,YM19146,California,F,4100.398533,47761.0,104.0,Personal Auto,Four-Door Car,541.282007,4.100399e+05
12069,LA72316,California,M,23405.98798,71941.0,73.0,Personal Auto,Four-Door Car,198.234764,2.340599e+06
12070,PK87824,California,F,3096.511217,21604.0,79.0,Corporate Auto,Four-Door Car,379.200000,3.096511e+05
12072,UP19263,California,M,7524.442436,21941.0,96.0,Personal Auto,Four-Door Car,691.200000,7.524442e+05